Revit 2027 API
FailureDefinition.CreateFailureDefinition Method
 Creates an instance of a FailureDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinition CreateFailureDefinition(
	FailureDefinitionId id,
	FailureSeverity severity,
	string messageString
)
Public Shared Function CreateFailureDefinition (
	id As FailureDefinitionId,
	severity As FailureSeverity,
	messageString As String
) As FailureDefinition
public:
static FailureDefinition^ CreateFailureDefinition(
	FailureDefinitionId^ id,
	FailureSeverity severity,
	String^ messageString
)
static member CreateFailureDefinition :
        id : FailureDefinitionId *
        severity : FailureSeverity *
        messageString : string -> FailureDefinition
Parameters
id FailureDefinitionId
 Unique identifier of the failure.
severity FailureSeverity
 The severity of the failure. Cannot be FailureSeverity::None.
messageString String
 A user-visible string describing the failure.
Return Value
FailureDefinition
 The created FailureDefinition instance.
Exceptions
Exception | Condition
ArgumentException |  The id of failure definition is not valid. -or- The id of failure definition is already used to register another FailureDefinition. -or- The severity of failures cannot be FailureSeverity::None. -or- Message string is empty or contains invalid characters.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The newly created FailureDefinition will be added to the FailureDefinitionRegistry. Because FailureDefinition could only be registered when Revit starting up, this function cannot be used after Revit has already started. Throws InvalidOperationException if invoked after Revit start-up is completed.
Example
// define a new failure id for a warning about walls
FailureDefinitionId warnId =
    new FailureDefinitionId(new Guid("FB4F5AF3-42BB-4371-B559-FB1648D5B4D1"));
// register the new warning using FailureDefinition
FailureDefinition failDef = FailureDefinition.CreateFailureDefinition(warnId,
    FailureSeverity.Warning,
    "Wall is too big (>100'). Performance problems may result.");
See Also
Reference
FailureDefinition Class
Autodesk.Revit.DB Namespace